xzcvczx/mla-legacy/Combo/Google Map/Configs/HWP_MEB_PIC32_ETH_SK_16PMP_QVGAv1.h
//#define USE_USB_BUS_SENSE_IO
#define tris_usb_bus_sense  TRISBbits.TRISB5    // Input
#define USB_BUS_SENSE       U1OTGSTATbits.SESVD // Special considerations required if using SESVD for this purpose.  See documentation.

#endif

#define COMM_PKT_RX_MAX_SIZE    (1024)

/*********************************************************************
* ERROR CHECKING
*********************************************************************/
/*
   This error check are intended for Microchip Development
   Boards and Modules. When using custom hardware, remove this part
   of the hardware profile.
*/
#if !defined (GFX_PICTAIL_V3) &&            \
    !defined (GFX_PICTAIL_V2) &&            \
    !defined (PIC24FJ256DA210_DEV_BOARD) && \
    !defined(MULTI_MEDIA_BOARD_DM00123)     
	#error "Error: Graphics Hardware Platform is not defined! One of the following boards (GFX_PICTAIL_V3, GFX_PICTAIL_V2, PIC24FJ256DA210_DEV_BOARD, MULTI_MEDIA_BOARD_DM00123) must be defined.
#endif

/*
   This check verifies that the selected PMP interface supports
   16-bit interface.
*/
#if defined (__PIC24FJ128GA010__) || defined (__PIC24FJ256GA110__) ||	\
	defined (__PIC24FJ256GB110__) || defined (__dsPIC33F__)        ||   \
	defined (__PIC24HJ128GP504__)
	#if defined (USE_16BIT_PMP)	
		#error "The device selected does not support 16 bit PMP interface."
	#endif
#endif

/*********************************************************************
* HARDWARE DEVICES SELECTION
*********************************************************************/
/*
    This portion selects the different components available to 
    the application depending on the hardware platform selected.
    * EXPLORER_16 - Explorer 16 Development Board (DM240001)
    * PIC24FJ256DA210_DEV_BOARD - PIC24FJ256DA210 Development Board (DM240312)
    * GFX_PICTAIL_V3 - Graphics LCD Controller PICtail Plus SSD1926 Board (AC164127-5)
    * GFX_PICTAIL_V3E - Graphics LCD Controller PICtail Plus Epson S1D13517 Board (AC164127-7)
    * MULTI_MEDIA_BOARD_DM00123 - MultiMedia Expansion Board (DM320005)
    * GFX_PICTAIL_V2 - NOT RECOMMENDED (obsolete development board)
*/
#if defined(PIC24FJ256DA210_DEV_BOARD)
	   #if defined (GFX_EPMP_CS2_BASE_ADDRESS)
	       #define  USE_SST39LF400					  // use the 4 Mbit (x16) Multi-Purpose (Parallel) Flash connected to EPMP CS 2 
       #else	
           #define	USE_SST25VF016                    // use the 16 Mbit SPI Serial Flash 
       #endif 
       #define      USE_TOUCHSCREEN_RESISTIVE         // use 4-wire resistive touch screen driver
#endif

#if defined(GFX_PICTAIL_V3)
       #define      USE_SST25VF016                    // use the 16 Mbit SPI Serial Flash 
       #define      USE_TOUCHSCREEN_RESISTIVE         // use 4-wire resistive touch screen driver
#endif

#ifdef MULTI_MEDIA_BOARD_DM00123
	   #define      USE_XC2C64A					      // use the CPLD on the board	
       #define      USE_SST25VF016                    // use the 16 Mbit SPI Serial Flash 
       #define      USE_TOUCHSCREEN_RESISTIVE         // use 4-wire resistive touch screen driver
	   #define      USE_ACCELEROMETER_BMA150		  // use the accelerometer module	
       #define      USE_JOYSTICK_MEB                  // use the joystick
#endif

#if defined(GFX_PICTAIL_V2) && defined (EXPLORER_16)
       #define      USE_SST39VF040                    // use the 4 Mbit (x8) Multi-Purpose (Parallel) Flash
       #define      USE_TOUCHSCREEN_RESISTIVE         // use 4-wire resistive touch screen driver
       #define      USE_MCHP25LC256                   // use the 256K SPI Bus Serial EEPROM on Explorer 16 
	   #define		USE_GFX_PICTAIL_V2_BEEPER         // use the PWM controlled beeper 
#endif

/*********************************************************************
* DISPLAY PARAMETERS 
*********************************************************************/
/*
    The following are the parameters required for the 
    different display drivers that is supported.
    When adding support to a new display controller or display panel,
    follow the parameterization of the driver for reusability of the
    driver.

    Display Parameter Macros Descriptions:
    
    1. DISP_ORIENTATION - defines the display rotation with
            respect to its native orientation. For example, if the display 
            has a resolution specifications that says 240x320 (QVGA), the
            display is natively in portrait mode. If the application
            uses the display in landscape mode (320x240), then the 
            orientation musts be defined as 90 or 180 degree rotation.
            The Graphics Library will calculate the actual pixel location
            to rotate the contents of the screen. So when users view the 
            display, the image on the screen will come out in the correct
            orientation.
            
            Valid values: 0, 90, 180 and 270
            Example: #define DISP_ORIENTATION 90

    2. DISP_HOR_RESOLUTION - defines the horizontal dimension in pixels. This 
            is the native horizontal dimension of the screen. In the example
            given in DISP_ORIENTATION, a 320x240 display will have DISP_HOR_RESOLUTION
            of 320.
            
            Valid Values: dependent on the display glass resolution used.
            Example: #define DISP_HOR_RESOLUTION 320 

    3. DISP_VER_RESOLUTION - defines the vertical dimension in pixels. This 
            is the native vertical dimension of the screen. In the example
            given in DISP_ORIENTATION, a 320x240 display will have DISP_VER_RESOLUTION
            of 240.
            
            Valid Values: dependent on the display glass resolution used.
            Example: #define DISP_VER_RESOLUTION 240 

    4. COLOR_DEPTH - (NOTE: Define this macro in the GraphicsConfig.h 
             This defines the vertical dimension in pixels. 
            
            Valid Values: 1, 4, 8, 16, 24 (note 24 bpp is only used if you are 
                          using a Display Driver that supports 24 bpp color depth.
            Example: #define COLOR_DEPTH 16 

    5. DISP_DATA_WIDTH - this defines the display controller physical interface 
            to the display panel. 

